performance-testing/blobs_test.yaml
config:
  processor: ./test-utils.js
  phases:
    - name: "Warm up"    # WARM UP PHASE: duration: 10s, starting with 1 new client/sec up to 5 new clients/sec
      duration: 10
      arrivalRate: 1
      rampTo: 5
    #- name: "Main test"    # MAIN TESTS: duration: 30s, with 10 new clients/sec. Should be varied depending on scenario.
      #duration: 30
      #arrivalRate: 10
  
  payload:
    path: ./data/users.csv
    order: random # selects users sequentially, default is random
    #loadAll: true # load the whole CSV
    skipHeader: true # The first line is a header, so we want to skip it
    delimiter: "," # standard delimiter
    skipEmptyLines: true # not important in our case
    fields:
      - "userId"
      - "pwd"
      - "email"
      - "displayName"

scenarios:
  - name: Register User
      weight: 10
      flow:
      - post:
          url: http://4.207.0.169:80/tukano-1/rest/users
          headers:
            Content-Type: application/json
            Accept: application/json
          beforeRequest: "uploadRandomizedUser"
  
  - name: "Get User's Shorts"
      weight: 50
      flow:
      - get:
          url: http://4.207.0.169:80/tukano-1/rest/shorts/{{ userId }}/shorts
          headers:
            Accept: application/json

  - name: 'Upload short'
      weight: 10
      flow:
      - post:
          url: http://4.207.0.169:80/tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}
          capture:
            json: "$"
            as: "shortInfo"
          afterResponse: "processShortAddReply"

      - post:
          url: "{{shortInfo.blobUrl}}"
          body: "{{shortInfo.blobUrl}}"
    
  - name: "Download short"
      weight: 100
      flow:
      - get:
          beforeRequest: "getShortDetails"
          url: http://4.207.0.169:80/tukano-1/rest/rest/shorts/{{ shortId }}
          capture:
            json: "$"
            as: "shortInfo"
      - get:
          url: "{{shortInfo.blobUrl}}"
  
  - name: "View feed" ///////
      weight: 200
      flow:
      - get:
          url: http://4.207.0.169:80/tukano-1/rest/shorts/{{ userId }}/feed?pwd={{ pwd }}
          headers:
            Accept: application/json
  
  - name: "Like short"
      weight: 50
      flow:
      - post:
          beforeRequest: "getShortDetails"
          url: http://4.207.0.169:80/tukano-1/rest/shorts/{{ shortId }}/{{ userId }}/likes?pwd={{ pwd }}
          headers:
            Content-Type: application/json
          body:
              '"True"'

  - name: "Get Short Likes"
      weight: 25
      flow:
     - get:
         beforeRequest: "getShortDetails"
         url: http://4.207.0.169:80/tukano-1/rest/shorts/{{ shortId }}/likes?pwd={{ pwd }}
         headers:
           Accept: application/json
  
  - name: "Get User Follows"
      weight: 20
      flow:
      - get:
          url: http://4.207.0.169:80/tukano-1/rest/shorts/{{ userId }}/followers?pwd={{ pwd }}
          headers:
            Accepts: application/json

  - name: "Follow user"
      weight: 50
      flow:
      - post:
          beforeRequest: "getRandomUsers"
          url: http://4.207.0.169:80/tukano-1/rest/shorts/{{ userId1 }}/{{ userId2 }}/followers?pwd={{ pwd }} 
          headers:
            Content-Type: application/json
          body:
            '"True"'