performance-testing/first_delete.yaml
config:
  target: http://4.207.0.169:80/tukano-1/rest
  plugins:
    metrics-by-endpoint: {}
  phases:
    - name: simple_delete
      duration: 50 # how long the test will run for, in seconds
      arrivalRate: 100 # number of arrivals per second.
  payload:
    path: ./data/users.csv
    order: sequence # selects users sequentially, default is random
    #loadAll: true # load the whole CSV
    skipHeader: true # The first line is a header, so we want to skip it
    delimiter: "," # standard delimiter
    skipEmptyLines: true # not important in our case
    fields:
      - "userId"
      - "pwd"
      - "email"
      - "displayName"

scenarios:
  - name: simpleDelete
    flow:
      - delete:
          url: "/users/{{userId}}?pwd={{pwd}}"