performance-testing/first_post.yaml
config:
  target: http://4.207.0.169:80/tukano-1/rest
  plugins:
    metrics-by-endpoint: {}
  phases:
    - name: simple_post
      duration: 50
      arrivalCount: 100
  payload:
    path: ./data/users.csv
    order: sequence # selects users sequentially, default is random
    #loadAll: true # load the whole CSV
    skipHeader: true # The first line is a header, so we want to skip it
    delimiter: "," # standard delimiter
    skipEmptyLines: true # not important in our case
    fields:
      - "userId"
      - "pwd"
      - "email"
      - "displayName"
scenarios:
  - name: posting
    flow:
      - post:
          url: /users/
          headers:
            Content-Type: application/json
          json:
            userId: "{{ userId }}" # this parameter is filled from the fields above
            pwd: "{{ pwd }}"
            email: "{{ email }}"
            displayName: "{{ displayName }}"