performance-testing/first_update.yaml
config:
  target: http://4.207.0.169:80/tukano-1/rest
  phases:
    - name: simple_update
      duration: 1
      arrivalRate: 1
scenarios:
  - name: simpleUpdate
    flow:
      - put:
          url: /users/john.c?pwd=1234
          headers:
            Content-Type: application/json
          json:
            userId: "john.c" # this parameter is filled from the fields above
            pwd: "1234"
            email: "smthsmth@email"
            displayName: "CoolName"