performance-testing/realistic_flow.yaml
config:
  target: "http://4.207.0.169:80" # Base URL for most requests
  plugins:
    metrics-by-endpoint: {} # Used to get metrics for each endpoint individually.
  processor: ./test-utils.js
  phases:
    - name: "Warm up" # WARM UP PHASE: duration: 10s, starting with 1 new client/sec up to 5 new clients/sec
      duration: 10
      arrivalRate: 1
      rampTo: 5
  #- name: "Main test"    # MAIN TESTS: duration: 30s, with 10 new clients/sec. Should be varied depending on scenario.
  #duration: 30
  #arrivalRate: 10
scenarios:
  - name: "Register user"
    weight: 10
    flow:
      - post:
          url: "/tukano-1/rest/users/"
          headers:
            Content-Type: application/json
            Accept: application/json
          beforeRequest: "uploadRandomizedUser"
          afterResponse: "processRegisterReply"

  - name: "Get User's Shorts"
    weight: 50
    flow:
      - get:
          beforeRequest: "getLoginDetails"
          url: "/tukano-1/rest/shorts/{{ userId }}/shorts"
          headers:
            Accept: application/json

  - name: "Upload short"
    weight: 10
    flow:
      - post:
          beforeRequest: "getLoginDetails"
          url: "/tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}"
          afterResponse: "processVideoAddReply"
      - post:
          beforeRequest: "uploadBlobBody"
          url: "http://4.207.0.141:8080/blobs-1/rest/blobs/{{ blobUrl }}"

  - name: "Download short"
    weight: 100
    flow:
      - get:
          beforeRequest: "getShortDownloadDetails"
          url: "/tukano-1/rest/shorts/{{ shortId }}"
          afterResponse: "processVideoGetReply"
      - get:
          url: "http://4.207.0.141:8080/blobs-1/rest/blobs/{{ blobUrl }}"

  - name: "View feed"
    weight: 200
    flow:
      - get:
          beforeRequest: "getLoginDetails"
          url: "/tukano-1/rest/shorts/{{ userId }}/feed?pwd={{ pwd }}"
          headers:
            Accept: application/json

  - name: "Like short"
    weight: 50
    flow:
      - post:
          beforeRequest: "setupLikeShort"
          url: "/tukano-1/rest/shorts/{{ shortId }}/{{ userId }}/likes?pwd={{ pwd }}"
          headers:
            Content-Type: application/json
          body: '"True"'

  - name: "Get Short Likes"
    weight: 25
    flow:
      - get:
          beforeRequest: "getShortDownloadDetails"
          url: "/tukano-1/rest/shorts/{{ shortId }}/likes?pwd={{ pwd }}"
          headers:
            Accept: application/json

  - name: "Get User Follows"
    weight: 20
    flow:
      - get:
          beforeRequest: "getLoginDetails"
          url: "/tukano-1/rest/shorts/{{ userId }}/followers?pwd={{ pwd }}"
          headers:
            Accepts: application/json

  - name: "Follow user"
    weight: 50
    flow:
      - post:
          beforeRequest: "getFollowDetails"
          url: "/tukano-1/rest/shorts/{{ userId1 }}/{{ userId2 }}/followers?pwd={{ pwd }}"
          headers:
            Content-Type: application/json
          body: '"True"'