performance-testing/short_tests.yaml
config:
  target: "http://4.207.0.169:80" # Base URL for Tukano API
  processor: ./test-utils.js
  phases:
    - name: "Warm up" # WARM UP PHASE: duration: 10s, starting with 1 new client/sec up to 5 new clients/sec
      duration: 10
      arrivalRate: 1
      rampTo: 5
  payload:
    path: ./data/users.csv
    order: random # Selects users sequentially; default is random
    skipHeader: true # The first line is a header, so we want to skip it
    delimiter: "," # Standard delimiter
    skipEmptyLines: true # Not important in our case
    fields:
      - "userId"
      - "pwd"
      - "email"
      - "displayName"
scenarios:
  - name: TuKano Short Create
    flow:
      - post:
          url: "/tukano-1/rest/shorts/{{userId}}?pwd={{pwd}}" # Relative URL based on the target
          capture:
            json: "$"
            as: "shortInfo"
          afterResponse: "processShortAddReply"

      - post:
          url: "{{shortInfo.blobUrl}}" # Absolute or derived URL for the blob service
          body: "{{shortInfo.blobUrl}}"