performance-testing/upload_shorts.yaml
config:
  target: "http://4.207.0.169:80"
  plugins:
    metrics-by-endpoint: {}
  processor: ./test-utils.js
  phases:
    - name: "Warm up"
      duration: 10
      arrivalRate: 1
      rampTo: 5
scenarios:
  - name: "Upload short"
    weight: 10
    flow:
      - post:
          beforeRequest: "getLoginDetails"
          url: "/tukano-1/rest/shorts/{{ userId }}?pwd={{ pwd }}"
          afterResponse: "processVideoAddReply"
      - post:
          beforeRequest: "uploadBlobBody"
          url: "http://4.207.0.141:8080/blobs-1/rest/blobs/{{ blobUrl }}"